<a href="https://colab.research.google.com/github/denko5/DAY-1-CHALLENGE/blob/main/Capstone2024_SEIKANI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


Loading Ext.

In [ ]:
%load_ext sql

Create a DB

In [ ]:
%%sql sqlite:///studentspending.db

 Create a table Student Details

In [ ]:
%%sql CREATE TABLE Student_Details (
    student_id INT PRIMARY KEY,
    age INT,
    gender VARCHAR (12),
    year_in_school VARCHAR (10),
    major VARCHAR (20)
);

 * sqlite:///studentspending.db
Done.

[]

Insert Data Into Student Details

In [ ]:
%%sql INSERT INTO Student_Details (student_id, age, gender, year_in_school, major) VALUES
(1, 19, 'Non-binary', 'Freshman', 'Psychology'),
(2, 24, 'Female', 'Junior', 'Economics'),
(3, 24, 'Non-binary', 'Junior', 'Economics'),
(4, 23, 'Female', 'Senior', 'Computer Science'),
(5, 20, 'Female', 'Senior', 'Computer Science'),
(6, 25, 'Non-binary', 'Sophomore', 'Computer Science'),
(7, 23, 'Female', 'Freshman', 'Engineering'),
(8, 23, 'Female', 'Junior', 'Economics'),
(9, 22, 'Non-binary', 'Senior', 'Computer Science'),
(10, 18, 'Female', 'Junior', 'Computer Science'),
(11, 23, 'Male', 'Junior', 'Biology'),
(12, 25, 'Male', 'Freshman', 'Engineering'),
(13, 21, 'Male', 'Sophomore', 'Economics'),
(14, 19, 'Female', 'Junior', 'Biology'),
(15, 24, 'Non-binary', 'Freshman', 'Economics'),
(16, 22, 'Non-binary', 'Sophomore', 'Computer Science'),
(17, 23, 'Female', 'Freshman', 'Psychology'),
(18, 21, 'Female', 'Freshman', 'Computer Science'),
(19, 19, 'Female', 'Sophomore', 'Psychology'),
(20, 20, 'Female', 'Senior', 'Engineering');

 * sqlite:///studentspending.db
20 rows affected.

[]

 Create Income Table

In [ ]:
%%sql CREATE TABLE Income (
    monthly_income INT PRIMARY KEY,
Financial_aid INT

);

 * sqlite:///studentspending.db
Done.

[]

In [ ]:
%%sql DROP TABLE Income

 * sqlite:///studentspending.db
Done.

[]

Recreate Table Income

In [ ]:
%%sql
CREATE TABLE Income (
    monthly_income INT PRIMARY KEY,
    financial_aid INT
);

 * sqlite:///studentspending.db
Done.

[]

 Insert Data Into Income

In [ ]:
%%sql
INSERT INTO Income (monthly_income, financial_aid) VALUES
(958, 270),
(1006, 875),
(734, 928),
(617, 265),
(810, 522),
(523, 790),
(1354, 69),
(631, 748),
(1402, 248),
(1423, 74),
(762, 615),
(1068, 19),
(719, 540),
(1176, 859),
(1496, 75),
(1227, 26),
(1419, 237),
(1454, 851),
(1487, 311),
(1157, 401);

 * sqlite:///studentspending.db
(sqlite3.OperationalError) no such table: Income
[SQL: INSERT INTO Income (monthly_income, financial_aid) VALUES
(958, 270),
(1006, 875),
(734, 928),
(617, 265),
(810, 522),
(523, 790),
(1354, 69),
(631, 748),
(1402, 248),
(1423, 74),
(762, 615),
(1068, 19),
(719, 540),
(1176, 859),
(1496, 75),
(1227, 26),
(1419, 237),
(1454, 851),
(1487, 311),
(1157, 401);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

 Create Table Basic Necesities.

In [ ]:
%%sql CREATE TABLE Basic_Necesities (
      housing INT
    food INT
      transportation INT

);

 * sqlite:///studentspending.db
Done.

[]

In [ ]:
%%sql DROP TABLE Basic_Necesities

 * sqlite:///studentspending.db
Done.

[]

 Recreate Table Basic Necesities

In [ ]:
%%sql CREATE TABLE Basic_Necesities (
    housing INT PRIMARY KEY,
    food INT,
      transportation INT
);

 * sqlite:///studentspending.db
Done.

[]

 Insert Into Basic_Necesities.

In [ ]:
%%sql
INSERT INTO Basic_Necesities (housing, food, transportation) VALUES
(709, 296, 123),
(557, 365, 85),
(666, 220, 137),
(652, 289, 114),
(825, 372, 168),
(413, 386, 122),
(812, 398, 101),
(571, 269, 92),
(599, 354, 82),
(626, 249, 117),
(660, 262, 58),
(734, 243, 200),
(894, 280, 120),
(628, 234, 50),
(657, 151, 63),
(884, 328, 167),
(883, 361, 200),
(754, 357, 110),
(188, 292, 69),
(886, 196, 131);

 * sqlite:///studentspending.db
20 rows affected.

[]

In [ ]:
%%sql
UPDATE
SET age = 30
WHERE id = 1;

In [ ]:
%%sql SELECT * FROM  Basic_Necesities

 * sqlite:///studentspending.db
Done.

[(709, 296, 123),
 (557, 365, 85),
 (666, 220, 137),
 (652, 289, 114),
 (825, 372, 168),
 (413, 386, 122),
 (812, 398, 101),
 (571, 269, 92),
 (599, 354, 82),
 (626, 249, 117),
 (660, 262, 58),
 (734, 243, 200),
 (894, 280, 120),
 (628, 234, 50),
 (657, 151, 63),
 (884, 328, 167),
 (883, 361, 200),
 (754, 357, 110),
 (188, 292, 69),
 (886, 196, 131)]

Create Table Academic Expenses

I

In [ ]:
%%sql CREATE TABLE Academic_Expenses (
    tuition INT PRIMARY KEY,
     books_supplies INT
);

 * sqlite:///studentspending.db
Done.

[]

 Insert Into Academic Expenses

In [ ]:
%%sql
INSERT INTO Academic_Expenses (tuition, books_supplies) VALUES
(5939, 188),
(4908, 252),
(3051, 99),
(4935, 223),
(3887, 194),
(3151, 131),
(4973, 213),
(3966, 251),
(5638, 155),
(3977, 123),
(4093, 183),
(5138, 228),
(4863, 126),
(5201, 274),
(5301, 92),
(4175, 175),
(5450, 141),
(3538, 188),
(4401, 51),
(3131, 216);

 * sqlite:///studentspending.db
20 rows affected.

[]

 Create Table Personal Expenses

In [ ]:
%%sql CREATE TABLE Personal_Expenses (
    perosnal_care INT PRIMARY KEY,
health_wellness INT
);

 * sqlite:///studentspending.db
Done.

[]

 Insert into Personal Expenses

In [ ]:
%%sql
INSERT INTO Personal_Expenses (perosnal_care, health_wellness) VALUES
(78, 127),
(92, 129),
(23, 112),
(30, 105),
(71, 71),
(35, 108),
(38, 117),
(90, 56),
(41, 172),
(74, 34),
(21, 66),
(57, 193),
(50, 113),
(77, 199),
(64, 50),
(96, 154),
(22, 185),
(24, 74),
(60, 181),
(39, 39);

 * sqlite:///studentspending.db
20 rows affected.

[]

Create Table Payment Method

In [ ]:
%%sql CREATE TABLE Payment_method(
                    student_id INT PRIMARY KEY,
                    preffered_payment_method VARCHAR (20),
                    FOREIGN KEY (student_id) references Student_Details(student_id) ON DELETE SET NULL

);

 * sqlite:///studentspending.db
Done.

[]